# 1번
# 횟수를 입력받아서 그 수만큼 Hello 출력하는 프로그램 만들기
# 5를 입력하면 
# 1번째 hello
# 2번째 hello
# 3번째 hello
# 4번째 hello
# 5번째 hello

# 이건 내가 한거
# i = 1
# while i < 6:
#     print(i,'번째 hello')  
#     i += 1

# count = int(input('횟수를 입력하세여>> '))
# i = 0
# while i < count:
#     i += 1
#     print(i,'번째 hello')

# print('====================================')


# # 2번
# # 1~100 사이의 7의 배수만 출력하는 프로그램 (while안에서 if를 사용)
# i = 1
# while i < 101:
#     if i % 7 == 0:
#         print(i)
#     i += 1


# print('===================================')




# # 3번
# # 커피 1잔에 300원, 금액(가진돈)을 입력하여 몇잔의 커피와 잔돈이 얼마가 남는지 출력
# # == 출력 예==
# #금액은 얼마인가요>> 1400원
# #커피 1잔, 잔돈 1100원
# #커피 2잔, 잔돈 800원
# #커피 3잔, 잔돈 500원
# #커피 4잔, 잔돈 2000원


# price = 300
# 금액 = int(input('금액을 입력해주세요>>'))
# 커피잔수 = 0

# # 저번에는 횟수로서 i = 0, 현재는 범위로써 금액 >= pirce
# while 금액 >= price:
#     금액 -= price
#     커피잔수 += 1
#     print('커피',커피잔수,'잔, 잔돈',금액,'원')










